betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_adc.h
  __IO uint32_t                 State;                       /*!< ADC communication state */

  __IO uint32_t                 ErrorCode;                   /*!< ADC Error code */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
  void (* ConvCpltCallback)(struct __ADC_HandleTypeDef *hadc);              /*!< ADC conversion complete callback */
  void (* ConvHalfCpltCallback)(struct __ADC_HandleTypeDef *hadc);          /*!< ADC conversion DMA half-transfer callback */
  void (* LevelOutOfWindowCallback)(struct __ADC_HandleTypeDef *hadc);      /*!< ADC analog watchdog 1 callback */
  void (* ErrorCallback)(struct __ADC_HandleTypeDef *hadc);                 /*!< ADC error callback */
  void (* InjectedConvCpltCallback)(struct __ADC_HandleTypeDef *hadc);      /*!< ADC group injected conversion complete callback */
  void (* MspInitCallback)(struct __ADC_HandleTypeDef *hadc);               /*!< ADC Msp Init callback */
  void (* MspDeInitCallback)(struct __ADC_HandleTypeDef *hadc);             /*!< ADC Msp DeInit callback */
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
}ADC_HandleTypeDef;

#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  DAL ADC Callback ID enumeration definition
  */
typedef enum
{
  DAL_ADC_CONVERSION_COMPLETE_CB_ID     = 0x00U,  /*!< ADC conversion complete callback ID */
  DAL_ADC_CONVERSION_HALF_CB_ID         = 0x01U,  /*!< ADC conversion DMA half-transfer callback ID */
  DAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID   = 0x02U,  /*!< ADC analog watchdog 1 callback ID */
  DAL_ADC_ERROR_CB_ID                   = 0x03U,  /*!< ADC error callback ID */
  DAL_ADC_INJ_CONVERSION_COMPLETE_CB_ID = 0x04U,  /*!< ADC group injected conversion complete callback ID */
  DAL_ADC_MSPINIT_CB_ID                 = 0x05U,  /*!< ADC Msp Init callback ID          */
  DAL_ADC_MSPDEINIT_CB_ID               = 0x06U   /*!< ADC Msp DeInit callback ID        */
} DAL_ADC_CallbackIDTypeDef;

/**
  * @brief  DAL ADC Callback pointer definition
  */
typedef  void (*pADC_CallbackTypeDef)(ADC_HandleTypeDef *hadc); /*!< pointer to a ADC callback function */

#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ADC_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */
#define DAL_ADC_ERROR_NONE        0x00U   /*!< No error                                              */
#define DAL_ADC_ERROR_INTERNAL    0x01U   /*!< ADC IP internal error: if problem of clocking,
                                               enable/disable, erroneous state                       */
#define DAL_ADC_ERROR_OVR         0x02U   /*!< Overrun error                                         */
#define DAL_ADC_ERROR_DMA         0x04U   /*!< DMA transfer error                                    */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
#define DAL_ADC_ERROR_INVALID_CALLBACK  (0x10U)   /*!< Invalid Callback error */
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */


#if defined(ADC_CCTRL_ADCPRE)
/** @defgroup ADC_ClockPrescaler  ADC Clock Prescaler
  * @{
  */
#define ADC_CLOCK_SYNC_PCLK_DIV2    0x00000000U
#define ADC_CLOCK_SYNC_PCLK_DIV4    ((uint32_t)ADC_CCTRL_ADCPRE_0)
#define ADC_CLOCK_SYNC_PCLK_DIV6    ((uint32_t)ADC_CCTRL_ADCPRE_1)
#define ADC_CLOCK_SYNC_PCLK_DIV8    ((uint32_t)ADC_CCTRL_ADCPRE)
/**
  * @}
  */
#endif /* ADC_CCTRL_ADCPRE */

#if defined(ADC_CCTRL_SMPDEL2)
/** @defgroup ADC_delay_between_2_sampling_phases ADC Delay Between 2 Sampling Phases
  * @{
  */
#define ADC_TWOSAMPLINGDELAY_5CYCLES    0x00000000U
#define ADC_TWOSAMPLINGDELAY_6CYCLES    ((uint32_t)ADC_CCTRL_SMPDEL2_0)
#define ADC_TWOSAMPLINGDELAY_7CYCLES    ((uint32_t)ADC_CCTRL_SMPDEL2_1)
#define ADC_TWOSAMPLINGDELAY_8CYCLES    ((uint32_t)(ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_9CYCLES    ((uint32_t)ADC_CCTRL_SMPDEL2_2)
#define ADC_TWOSAMPLINGDELAY_10CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_11CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1))
#define ADC_TWOSAMPLINGDELAY_12CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_13CYCLES   ((uint32_t)ADC_CCTRL_SMPDEL2_3)
#define ADC_TWOSAMPLINGDELAY_14CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_15CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_1))
#define ADC_TWOSAMPLINGDELAY_16CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_1 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_17CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2))
#define ADC_TWOSAMPLINGDELAY_18CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_0))
#define ADC_TWOSAMPLINGDELAY_19CYCLES   ((uint32_t)(ADC_CCTRL_SMPDEL2_3 | ADC_CCTRL_SMPDEL2_2 | ADC_CCTRL_SMPDEL2_1))
#define ADC_TWOSAMPLINGDELAY_20CYCLES   ((uint32_t)ADC_CCTRL_SMPDEL2)
/**
  * @}
  */
#endif /* ADC_CCTRL_SMPDEL2 */

#if defined(ADC_CTRL1_RESSEL)
/** @defgroup ADC_Resolution ADC Resolution
  * @{
  */
#define ADC_RESOLUTION_12B  0x00000000U
#define ADC_RESOLUTION_10B  ((uint32_t)ADC_CTRL1_RESSEL_0)
#define ADC_RESOLUTION_8B   ((uint32_t)ADC_CTRL1_RESSEL_1)
#define ADC_RESOLUTION_6B   ((uint32_t)ADC_CTRL1_RESSEL)
/**
  * @}
  */
#endif /* ADC_CTRL1_RESSEL */

/** @defgroup ADC_External_trigger_edge_Regular ADC External Trigger Edge Regular
  * @{
  */
#define ADC_EXTERNALTRIGCONVEDGE_NONE           0x00000000U
#define ADC_EXTERNALTRIGCONVEDGE_RISING         ((uint32_t)ADC_CTRL2_REGEXTTRGEN_0)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define ADC_EXTERNALTRIGCONVEDGE_FALLING        ((uint32_t)ADC_CTRL2_REGEXTTRGEN_1)
#define ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING  ((uint32_t)ADC_CTRL2_REGEXTTRGEN)
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup ADC_External_trigger_Source_Regular ADC External Trigger Source Regular
  * @{
  */
/* Note: Parameter ADC_SOFTWARE_START is a software parameter used for        */
/*       compatibility with other APM32 devices.                              */
#if defined(APM32F403xx) || defined(APM32F402xx)
/* External triggers of regular group for ADC1&ADC2 (if ADCx available) */
#define ADC1_2_EXTERNALTRIG_T1_CC1      0x00000000U
#define ADC1_2_EXTERNALTRIG_T1_CC2      ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_0)
#define ADC1_2_EXTERNALTRIG_T2_CC2      ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_1 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC1_2_EXTERNALTRIG_T3_TRGO     ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_2)
#define ADC1_2_EXTERNALTRIG_T4_CC4      ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC1_2_EXTERNALTRIG_EXT_IT11    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_1))

