betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_adc.h
/* External triggers of regular group for ADC3 */
#define ADC3_EXTERNALTRIG_T3_CC1        ADC1_2_EXTERNALTRIG_T1_CC1
#define ADC3_EXTERNALTRIG_T2_CC3        ADC1_2_EXTERNALTRIG_T1_CC2
#define ADC3_EXTERNALTRIG_T8_CC1        ADC1_2_EXTERNALTRIG_T2_CC2
#define ADC3_EXTERNALTRIG_T8_TRGO       ADC1_2_EXTERNALTRIG_T3_TRGO
#define ADC3_EXTERNALTRIG_T5_CC1        ADC1_2_EXTERNALTRIG_T4_CC4
#define ADC3_EXTERNALTRIG_T5_CC3        ADC1_2_EXTERNALTRIG_EXT_IT11

/* External triggers of regular group for ADC1&ADC2&ADC3 (if ADCx available) */
#define ADC1_2_3_EXTERNALTRIG_T1_CC3    ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_1)
#define ADC1_2_3_SWSTART                ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_1 | ADC_CTRL2_REGEXTTRGSEL_0))

/* External triggers of regular group for ADC1&ADC2 (if ADCx available) */
#define ADC_EXTERNALTRIGCONV_T1_CC1     ADC1_2_EXTERNALTRIG_T1_CC1
#define ADC_EXTERNALTRIGCONV_T1_CC2     ADC1_2_EXTERNALTRIG_T1_CC2
#define ADC_EXTERNALTRIGCONV_T2_CC2     ADC1_2_EXTERNALTRIG_T2_CC2
#define ADC_EXTERNALTRIGCONV_T3_TRGO    ADC1_2_EXTERNALTRIG_T3_TRGO
#define ADC_EXTERNALTRIGCONV_T4_CC4     ADC1_2_EXTERNALTRIG_T4_CC4
#define ADC_EXTERNALTRIGCONV_EXT_IT11   ADC1_2_EXTERNALTRIG_EXT_IT11

/*!< External triggers of regular group for ADC3 only */
#define ADC_EXTERNALTRIGCONV_T2_CC3     ADC3_EXTERNALTRIG_T2_CC3
#define ADC_EXTERNALTRIGCONV_T3_CC1     ADC3_EXTERNALTRIG_T3_CC1
#define ADC_EXTERNALTRIGCONV_T5_CC1     ADC3_EXTERNALTRIG_T5_CC1
#define ADC_EXTERNALTRIGCONV_T5_CC3     ADC3_EXTERNALTRIG_T5_CC3
#define ADC_EXTERNALTRIGCONV_T8_CC1     ADC3_EXTERNALTRIG_T8_CC1
#define ADC_EXTERNALTRIGCONV_T8_TRGO    ADC3_EXTERNALTRIG_T8_TRGO

/*!< External triggers of regular group for all ADC instances */
#define ADC_EXTERNALTRIGCONV_T1_CC3     ADC1_2_3_EXTERNALTRIG_T1_CC3
#define ADC_SOFTWARE_START              ADC1_2_3_SWSTART
#else
#define ADC_EXTERNALTRIGCONV_T1_CC1    0x00000000U
#define ADC_EXTERNALTRIGCONV_T1_CC2    ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_0)
#define ADC_EXTERNALTRIGCONV_T1_CC3    ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_1)
#define ADC_EXTERNALTRIGCONV_T2_CC2    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_1 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T2_CC3    ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_2)
#define ADC_EXTERNALTRIGCONV_T2_CC4    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T2_TRGO   ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGCONV_T3_CC1    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_1 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T3_TRGO   ((uint32_t)ADC_CTRL2_REGEXTTRGSEL_3)
#define ADC_EXTERNALTRIGCONV_T4_CC4    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T5_CC1    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGCONV_T5_CC2    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_1 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T5_CC3    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_2))
#define ADC_EXTERNALTRIGCONV_T8_CC1    ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGCONV_T8_TRGO   ((uint32_t)(ADC_CTRL2_REGEXTTRGSEL_3 | ADC_CTRL2_REGEXTTRGSEL_2 | ADC_CTRL2_REGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGCONV_EXT_IT11  ((uint32_t)ADC_CTRL2_REGEXTTRGSEL)
#define ADC_SOFTWARE_START             ((uint32_t)ADC_CTRL2_REGEXTTRGSEL + 1U)
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup ADC_Data_align ADC Data Align
  * @{
  */
#define ADC_DATAALIGN_RIGHT      0x00000000U
#define ADC_DATAALIGN_LEFT       ((uint32_t)ADC_CTRL2_DALIGNCFG)
/**
  * @}
  */

/** @defgroup ADC_channels  ADC Common Channels
  * @{
  */
#define ADC_CHANNEL_0           0x00000000U
#define ADC_CHANNEL_1           ((uint32_t)ADC_CTRL1_AWDCHSEL_0)
#define ADC_CHANNEL_2           ((uint32_t)ADC_CTRL1_AWDCHSEL_1)
#define ADC_CHANNEL_3           ((uint32_t)(ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_4           ((uint32_t)ADC_CTRL1_AWDCHSEL_2)
#define ADC_CHANNEL_5           ((uint32_t)(ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_6           ((uint32_t)(ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1))
#define ADC_CHANNEL_7           ((uint32_t)(ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_8           ((uint32_t)ADC_CTRL1_AWDCHSEL_3)
#define ADC_CHANNEL_9           ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_10          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_1))
#define ADC_CHANNEL_11          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_12          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2))
#define ADC_CHANNEL_13          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_14          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1))
#define ADC_CHANNEL_15          ((uint32_t)(ADC_CTRL1_AWDCHSEL_3 | ADC_CTRL1_AWDCHSEL_2 | ADC_CTRL1_AWDCHSEL_1 | ADC_CTRL1_AWDCHSEL_0))
#define ADC_CHANNEL_16          ((uint32_t)ADC_CTRL1_AWDCHSEL_4)
#define ADC_CHANNEL_17          ((uint32_t)(ADC_CTRL1_AWDCHSEL_4 | ADC_CTRL1_AWDCHSEL_0))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define ADC_CHANNEL_18          ((uint32_t)(ADC_CTRL1_AWDCHSEL_4 | ADC_CTRL1_AWDCHSEL_1))
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define ADC_CHANNEL_VREFINT     ((uint32_t)ADC_CHANNEL_17)
#define ADC_CHANNEL_VBAT        ((uint32_t)ADC_CHANNEL_18)
#else
#define ADC_CHANNEL_TEMPSENSOR  ((uint32_t)ADC_CHANNEL_16)
#define ADC_CHANNEL_VREFINT     ((uint32_t)ADC_CHANNEL_17)
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

