betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_adc.h
/** @defgroup ADC_sampling_times  ADC Sampling Times
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define ADC_SAMPLETIME_1CYCLE_5     0x00000000U
#define ADC_SAMPLETIME_7CYCLES_5    ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_0)
#define ADC_SAMPLETIME_13CYCLES_5   ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_1)
#define ADC_SAMPLETIME_28CYCLES_5   ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_1 | ADC_SMPTIM1_SMPCYCCFG10_0))
#define ADC_SAMPLETIME_41CYCLES_5   ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_2)
#define ADC_SAMPLETIME_55CYCLES_5   ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_0))
#define ADC_SAMPLETIME_71CYCLES_5   ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_1))
#define ADC_SAMPLETIME_239CYCLES_5  ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10)
#else
#define ADC_SAMPLETIME_3CYCLES      0x00000000U
#define ADC_SAMPLETIME_15CYCLES     ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_0)
#define ADC_SAMPLETIME_28CYCLES     ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_1)
#define ADC_SAMPLETIME_56CYCLES     ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_1 | ADC_SMPTIM1_SMPCYCCFG10_0))
#define ADC_SAMPLETIME_84CYCLES     ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10_2)
#define ADC_SAMPLETIME_112CYCLES    ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_0))
#define ADC_SAMPLETIME_144CYCLES    ((uint32_t)(ADC_SMPTIM1_SMPCYCCFG10_2 | ADC_SMPTIM1_SMPCYCCFG10_1))
#define ADC_SAMPLETIME_480CYCLES    ((uint32_t)ADC_SMPTIM1_SMPCYCCFG10)
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup ADC_regular_rank ADC rank into regular group
  * @{
  */
#define ADC_REGULAR_RANK_1                 0x00000001U
#define ADC_REGULAR_RANK_2                 0x00000002U
#define ADC_REGULAR_RANK_3                 0x00000003U
#define ADC_REGULAR_RANK_4                 0x00000004U
#define ADC_REGULAR_RANK_5                 0x00000005U
#define ADC_REGULAR_RANK_6                 0x00000006U
#define ADC_REGULAR_RANK_7                 0x00000007U
#define ADC_REGULAR_RANK_8                 0x00000008U
#define ADC_REGULAR_RANK_9                 0x00000009U
#define ADC_REGULAR_RANK_10                0x0000000AU
#define ADC_REGULAR_RANK_11                0x0000000BU
#define ADC_REGULAR_RANK_12                0x0000000CU
#define ADC_REGULAR_RANK_13                0x0000000DU
#define ADC_REGULAR_RANK_14                0x0000000EU
#define ADC_REGULAR_RANK_15                0x0000000FU
#define ADC_REGULAR_RANK_16                0x00000010U
/**
  * @}
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /** @defgroup ADC_EOCSelection ADC EOC Selection
  * @{
  */
#define ADC_EOC_SEQ_CONV              0x00000000U
#define ADC_EOC_SINGLE_CONV           0x00000001U
#define ADC_EOC_SINGLE_SEQ_CONV       0x00000002U  /*!< reserved for future use */
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup ADC_Event_type ADC Event Type
  * @{
  */
#define ADC_AWD_EVENT             ((uint32_t)ADC_FLAG_AWD)
#if defined(ADC_STS_OVRFLG)
#define ADC_OVR_EVENT             ((uint32_t)ADC_FLAG_OVR)
#endif /* ADC_STS_OVRFLG */
/**
  * @}
  */

/** @defgroup ADC_analog_watchdog_selection ADC Analog Watchdog Selection
  * @{
  */
#define ADC_ANALOGWATCHDOG_SINGLE_REG         ((uint32_t)(ADC_CTRL1_AWDSGLEN | ADC_CTRL1_REGAWDEN))
#define ADC_ANALOGWATCHDOG_SINGLE_INJEC       ((uint32_t)(ADC_CTRL1_AWDSGLEN | ADC_CTRL1_INJAWDEN))
#define ADC_ANALOGWATCHDOG_SINGLE_REGINJEC    ((uint32_t)(ADC_CTRL1_AWDSGLEN | ADC_CTRL1_REGAWDEN | ADC_CTRL1_INJAWDEN))
#define ADC_ANALOGWATCHDOG_ALL_REG            ((uint32_t)ADC_CTRL1_REGAWDEN)
#define ADC_ANALOGWATCHDOG_ALL_INJEC          ((uint32_t)ADC_CTRL1_INJAWDEN)
#define ADC_ANALOGWATCHDOG_ALL_REGINJEC       ((uint32_t)(ADC_CTRL1_REGAWDEN | ADC_CTRL1_INJAWDEN))
#define ADC_ANALOGWATCHDOG_NONE               0x00000000U
/**
  * @}
  */

#if defined(ADC_OSAMPCTRL_OSR)
/** @defgroup ADC_oversampling_ratio  ADC Oversampling Ratio
  * @{
  */
#define ADC_OVERSAMPLING_RATIO_2       (0x00000000U)
#define ADC_OVERSAMPLING_RATIO_4       ((uint32_t)ADC_OSAMPCTRL_OSR_0)
#define ADC_OVERSAMPLING_RATIO_8       ((uint32_t)ADC_OSAMPCTRL_OSR_1)
#define ADC_OVERSAMPLING_RATIO_16      ((uint32_t)(ADC_OSAMPCTRL_OSR_1 | ADC_OSAMPCTRL_OSR_0))
#define ADC_OVERSAMPLING_RATIO_32      ((uint32_t)ADC_OSAMPCTRL_OSR_2)
#define ADC_OVERSAMPLING_RATIO_64      ((uint32_t)(ADC_OSAMPCTRL_OSR_2 | ADC_OSAMPCTRL_OSR_0))
#define ADC_OVERSAMPLING_RATIO_128     ((uint32_t)(ADC_OSAMPCTRL_OSR_2 | ADC_OSAMPCTRL_OSR_1))
#define ADC_OVERSAMPLING_RATIO_256     ((uint32_t)(ADC_OSAMPCTRL_OSR_2 | ADC_OSAMPCTRL_OSR_1 | ADC_OSAMPCTRL_OSR_0))
/**
  * @}
  */
#endif /* ADC_OSAMPCTRL_OSR */

#if defined(ADC_OSAMPCTRL_OSS)
/** @defgroup ADC_oversampling_data_shift  ADC Oversampling Data Shift
  * @{
  */
#define ADC_OVERSAMPLING_SHIFT_0       (0x00000000U)
#define ADC_OVERSAMPLING_SHIFT_1       ((uint32_t)ADC_OSAMPCTRL_OSS_0)
#define ADC_OVERSAMPLING_SHIFT_2       ((uint32_t)ADC_OSAMPCTRL_OSS_1)
#define ADC_OVERSAMPLING_SHIFT_3       ((uint32_t)(ADC_OSAMPCTRL_OSS_1 | ADC_OSAMPCTRL_OSS_0))
#define ADC_OVERSAMPLING_SHIFT_4       ((uint32_t)ADC_OSAMPCTRL_OSS_2)
#define ADC_OVERSAMPLING_SHIFT_5       ((uint32_t)(ADC_OSAMPCTRL_OSS_2 | ADC_OSAMPCTRL_OSS_0))
#define ADC_OVERSAMPLING_SHIFT_6       ((uint32_t)(ADC_OSAMPCTRL_OSS_2 | ADC_OSAMPCTRL_OSS_1))
#define ADC_OVERSAMPLING_SHIFT_7       ((uint32_t)(ADC_OSAMPCTRL_OSS_2 | ADC_OSAMPCTRL_OSS_1 | ADC_OSAMPCTRL_OSS_0))
#define ADC_OVERSAMPLING_SHIFT_8       ((uint32_t)ADC_OSAMPCTRL_OSS_3)
/**
  * @}
  */
#endif /* ADC_OSAMPCTRL_OSS */

#if defined(ADC_OSAMPCTRL_TOS)
/** @defgroup ADC_oversampling_triggered_mode  ADC Oversampling Triggered Mode
  * @{
  */
#define ADC_OVERSAMPLING_MULTI_TRIGGER  (0x00000000U)
#define ADC_OVERSAMPLING_SINGLE_TRIGGER ((uint32_t)ADC_OSAMPCTRL_TOS)
/**
  * @}
  */
#endif /* ADC_OSAMPCTRL_TOS */

/** @defgroup ADC_interrupts_definition ADC Interrupts Definition
  * @{
  */
#define ADC_IT_EOC      ((uint32_t)ADC_CTRL1_EOCIEN)
#define ADC_IT_AWD      ((uint32_t)ADC_CTRL1_AWDIEN)
#define ADC_IT_JEOC     ((uint32_t)ADC_CTRL1_INJEOCIEN)
#if defined(ADC_CTRL1_OVRIEN)
#define ADC_IT_OVR      ((uint32_t)ADC_CTRL1_OVRIEN)
#endif /* ADC_CTRL1_OVRIEN */
/**
  * @}
  */

