betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_adc.h
#if defined(ADC_OSAMPCTRL_OSR)
#define IS_ADC_OVERSAMPLING_RATIO(RATIO) (((RATIO) == ADC_OVERSAMPLING_RATIO_2)   || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_4)   || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_8)   || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_16)  || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_32)  || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_64)  || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_128) || \
                               ((RATIO) == ADC_OVERSAMPLING_RATIO_256))
#endif /* ADC_OSAMPCTRL_OSR */

#if defined(ADC_OSAMPCTRL_OSS)
#define IS_ADC_OVERSAMPLING_SHIFT(SHIFT) (((SHIFT) == ADC_OVERSAMPLING_SHIFT_0) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_1) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_2) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_3) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_4) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_5) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_6) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_7) || \
                                          ((SHIFT) == ADC_OVERSAMPLING_SHIFT_8))
#endif /* ADC_OSAMPCTRL_OSS */

#if defined(ADC_OSAMPCTRL_TOS)
#define IS_ADC_OVERSAMPLING_MODE(MODE) (((MODE) == ADC_OVERSAMPLING_MULTI_TRIGGER) || \
                                         ((MODE) == ADC_OVERSAMPLING_SINGLE_TRIGGER))
#endif /* ADC_OSAMPCTRL_TOS */

/**
  * @brief  Set ADC Regular channel sequence length.
  * @param  _NbrOfConversion_ Regular channel sequence length.
  * @retval None
  */
#define ADC_REGSEQ1(_NbrOfConversion_) (((_NbrOfConversion_) - (uint8_t)1U) << 20U)

/**
  * @brief  Set the ADC's sample time for channel numbers between 10 and 18.
  * @param  _SAMPLETIME_ Sample time parameter.
  * @param  _CHANNELNB_ Channel number.
  * @retval None
  */
#define ADC_SMPTIM1(_SAMPLETIME_, _CHANNELNB_) ((_SAMPLETIME_) << (3U * (((uint32_t)((uint16_t)(_CHANNELNB_))) - 10U)))

/**
  * @brief  Set the ADC's sample time for channel numbers between 0 and 9.
  * @param  _SAMPLETIME_ Sample time parameter.
  * @param  _CHANNELNB_ Channel number.
  * @retval None
  */
#define ADC_SMPTIM2(_SAMPLETIME_, _CHANNELNB_) ((_SAMPLETIME_) << (3U * ((uint32_t)((uint16_t)(_CHANNELNB_)))))

/**
  * @brief  Set the selected regular channel rank for rank between 1 and 6.
  * @param  _CHANNELNB_ Channel number.
  * @param  _RANKNB_ Rank number.
  * @retval None
  */
#define ADC_REGSEQ3_RK(_CHANNELNB_, _RANKNB_) (((uint32_t)((uint16_t)(_CHANNELNB_))) << (5U * ((_RANKNB_) - 1U)))

/**
  * @brief  Set the selected regular channel rank for rank between 7 and 12.
  * @param  _CHANNELNB_ Channel number.
  * @param  _RANKNB_ Rank number.
  * @retval None
  */
#define ADC_REGSEQ2_RK(_CHANNELNB_, _RANKNB_) (((uint32_t)((uint16_t)(_CHANNELNB_))) << (5U * ((_RANKNB_) - 7U)))

/**
  * @brief  Set the selected regular channel rank for rank between 13 and 16.
  * @param  _CHANNELNB_ Channel number.
  * @param  _RANKNB_ Rank number.
  * @retval None
  */
#define ADC_REGSEQ1_RK(_CHANNELNB_, _RANKNB_) (((uint32_t)((uint16_t)(_CHANNELNB_))) << (5U * ((_RANKNB_) - 13U)))

/**
  * @brief  Enable ADC continuous conversion mode.
  * @param  _CONTINUOUS_MODE_ Continuous mode.
  * @retval None
  */
#define ADC_CTRL2_CONTCENINUOUS(_CONTINUOUS_MODE_) ((_CONTINUOUS_MODE_) << 1U)

/**
  * @brief  Configures the number of discontinuous conversions for the regular group channels.
  * @param  _NBR_DISCONTINUOUSCONV_ Number of discontinuous conversions.
  * @retval None
  */
#define ADC_CTRL1_DISCONTINUOUS(_NBR_DISCONTINUOUSCONV_) (((_NBR_DISCONTINUOUSCONV_) - 1U) << ADC_CTRL1_DISCNUMCFG_Pos)

/**
  * @brief  Enable ADC scan mode.
  * @param  _SCANCONV_MODE_ Scan conversion mode.
  * @retval None
  */
#define ADC_CTRL1_SCANENCONV(_SCANCONV_MODE_) ((_SCANCONV_MODE_) << 8U)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/**
  * @brief  Enable the ADC end of conversion selection.
  * @param  _EOCSelection_MODE_ End of conversion selection mode.
  * @retval None
  */
#define ADC_CTRL2_EOCSELelection(_EOCSelection_MODE_) ((_EOCSelection_MODE_) << 10U)
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @brief  Enable the ADC DMA continuous request.
  * @param  _DMAContReq_MODE_ DMA continuous request mode.
  * @retval None
  */
#define ADC_CTRL2_DMAENContReq(_DMAContReq_MODE_) ((_DMAContReq_MODE_) << 9U)

#if defined(ADC_CTRL1_RESSEL)
/**
  * @brief Return resolution bits in CTRL1 register.
  * @param __HANDLE__ ADC handle
  * @retval None
  */
#define ADC_GET_RESOLUTION(__HANDLE__) (((__HANDLE__)->Instance->CTRL1) & ADC_CTRL1_RESSEL)
#endif /* ADC_CTRL1_RESSEL */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup ADC_Private_Functions ADC Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_ADC_H */


